app/controllers/microposts_controller.rb

DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 9]]
---
  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy