app/controllers/static_pages_controller.rb

SELECT "microposts".* FROM "microposts" ORDER BY microposts.created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (NULL) OR user_id = 1)
---
  def home
    @micropost  = current_user.microposts.build
    @feed_items = Micropost.paginate(page: params[:page], per_page: 10)