app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "email" = 'detlef.wiedenbruch@gmx.de', "password_digest" = '$2a$10$I16C94RWxRo4JQGcgQT7AOE0xd.RvW.fPXm2ZK0c9nIgcET1x6gwC', "remember_token" = '0hAu4jk3bdQpqTm56ToF5Q', "updated_at" = '2012-08-24 16:00:43.270539' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def deactivate
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
  def activate
    @user = User.find(params[:id])